﻿// 3. Напишите программу, которая будет выдавать
// название дня недели по заданному номеру.
// 3 -> Среда
// 5 -> Пятница



Console.WriteLine("Введите номер дня недели");
string dayNumber = Console.ReadLine();

if(dayNumber == "1")
{
Console.WriteLine("Понедельник");
}

else if(dayNumber == "2")
{
Console.WriteLine("Vtornik");
}

else if(dayNumber == "3")
{
Console.WriteLine("Sreda");
}
else if(dayNumber == "4")
{
Console.WriteLine("Chetverg");
}

else if(dayNumber == "5")
{
Console.WriteLine("Pyatnica");
}
else if(dayNumber == "6")
{
Console.WriteLine("Subbota");
}
else if(dayNumber == "7")
{
Console.WriteLine("Voskresenie");
}

