// 20. Напишите программу которая принимает на вход координаты двух точек и находит расстояние между ними 2D пространстве
// А (3,6); B(2,1) -> 5,09
// A (7, -5) B (1, -1) -> 7,21

double find(int xA, int yA, int xB, int yB)
{
  return Math.sgrt(xA, yA,)
}

double sgrt = Math.Sqrt(5); // квадратный корень
double pow = Math.Pow(5, 3); // возведение в степень

double d = 5.098889; // 5.09
double dRound = Math.Round(d, 2, MidpointRounding.ToZero);
Console.WriteLine(dRound); // округление
Console.WriteLine($"{d:F2}");